/*******************************************************************************
****文件路径         : .\main\fingerID.cpp
****作者名称         : Scaxlibur
****文件版本         : V1.0.0
****创建日期         : 2024-10-21 20:25:26
****简要说明         : 指纹识别模块
********************************************************************************/

#include "fingerID.hpp"

/*******************************************************************************
****函数功能: 初始化指纹识别模块
****入口参数: 无
****出口参数: true: 设置成功 false: 设置失败
****函数备注: 无
********************************************************************************/

bool IDENTIFIER::ID_init()
{
    return true;
}


/*******************************************************************************
****函数功能: 发送命令包
****入口参数: 指令
****出口参数:
****函数备注: 包头+芯片地址+包标识01+包长度+指令+参数+校验和
********************************************************************************/

void IDENTIFIER::transCommand(uint16_t command, uint16_t parameter)
{
    uint16_t packLength = 1 + 2; //包长度是包长度至校验和的总字节数，包含校验和，但不包含包长度本身的字节数。纯指令+校验和是3字节。
    uint16_t checksum = packLength + command + parameter; //校验和是从包标识至校验和之间所有字节之和。
    char32_t commandPack[8] = {PACKHEAD, IDaddr, COMMANDSIGN, packLength, command, parameter, checksum};
    uart_write_bytes(UART_NUM_ID, commandPack, sizeof(commandPack));
}